{
    "experiences": [
        {
            "title": "Teaching Assistant",
            "subtitle": "AEM-4601, University of Minnesota",
            "workType": "Part-time",
            "workDescription": [
                "Evaluate, grade and provide feedback on student submissions.",
                "Lead lab sessions, ensuring student engagement and safety.",
                "Offer academic support during scheduled office hours.",
                "Prepare and organize lab materials and equipment prior to sessions to ensure a smooth and productive learning environment."
            ],
            "dateText": "01/2024 - 05/2024"
        },
        {
            "title": "Software Engineer Trainee",
            "subtitle": "Esko",
            "workType": "Full-time",
            "workDescription": [
                "Developed responsive React components from Figma designs, significantly enhancing the user interface and experience for over 2000 users, aligning with fast-paced software delivery expectations.",
                "Engineered Java Spring Boot microservices to streamline real-time data retrieval from Elasticsearch, boosting frontend data display efficiency by over 30% and significantly enhancing user interaction and system performance.",      
                "Led a Jenkins-based initiative to automate REST API testing, which reduced testing time by 90% and enhanced code quality by 45%, showcasing my ability to quickly adapt and improve software testing processes.",
                "Directed the resolution of 85% of identified security vulnerabilities, significantly bolstering software security and reliability, a critical aspect of maintaining system health in data centers.",
                "Participate In Agile Software Development Methodologies Such As Scrum And Involved In Daily Stand-Ups, Sprint Reviews, And Retrospectives.",
                "Recognized with an award in 2023 for exceptional performance and dedication, underlining my commitment to high-quality, timely project executions and contributions to product enhancements."
            ],
            "dateText": "08/2022 - 07/2023"
        },
        {
            "title": "Software Engineer Trainee Intern",
            "subtitle": "Esko",
            "workType": "Internship",
            "workDescription": [
                "Worked on developing projects in various programming languages such as C++, Java, and JavaScript.",
                "Developed an e-commerce website using React and Java Springboot where customers could view the product, add them to the cart, and checkout. The admin could restock products.",
                "Developed a project in C++ using Dijkstra's algorithm to find the shortest distance between the source and destination countries. Based on the distance, rewards would be given to the customer.",
                "Converted the customer requirements to UML class diagrams for better mapping and relations between classes.",
                "Researched in Confluence about the products and technologies in the company and documented my learning.",
                "Gained insight into the corporate culture by participating in scrum events such as daily stand-ups and grooming."
            ],
            "dateText": "03/2022 - 07/2022"
        }
    ]
}